app/controllers/api/v1/surveys_controller.rb

SELECT "surveys".* FROM "surveys" WHERE "surveys"."user_id" = $1 ORDER BY "surveys"."created_at" DESC  [["user_id", 2]]
---
  def index
    @surveys = Survey.where(user_id: current_user.id).order(:created_at => :desc)

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
SELECT  "assigned_surveys".* FROM "assigned_surveys" WHERE "assigned_surveys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  1 AS one FROM "assigned_surveys" WHERE "assigned_surveys"."survey_id" = $1 AND "assigned_surveys"."answered" = $2 AND "assigned_surveys"."evaluated_user_id" = $3 LIMIT $4  [["survey_id", 13], ["answered", true], ["evaluated_user_id", 3], ["LIMIT", 1]]
---
  def save_survey_answers

  survey = Survey.find_by(id: params[:survey_id])
    assigned_ids = AssignedSurvey.with_answer(true).where(survey_id: survey.id)
    current = SurveyResult.where(assigned_survey_id: assigned_ids).count

    if !survey.present?
      json_response({ errors: "Survey with id #{params[:survey_id]} did not exist yet" }, :unprocessable_entity)
      return
    end
    owner_id = survey.user_id
    if current_user.id == owner_id
      p '----------------------------------------------'
        puts 'IF OWNER SURVEY TRY ANSWER?'
      p '----------------------------------------------'
      return json_response({errors: 'you cannot reply to your own survey'}, :unprocessable_entity)
    end

    user_already_answered = survey.assigned_surveys.with_answer(true).where(evaluated_user_id: current_user.id).any?

INSERT INTO "feedbacks" ("user_id", "question_id", "solution_id", "survey_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 3], ["question_id", 11], ["solution_id", 13], ["survey_id", 11], ["content", "test"], ["created_at", "2018-05-17 17:24:14.139680"], ["updated_at", "2018-05-17 17:24:14.139680"]]
INSERT INTO "assigned_surveys" ("answered", "created_at", "updated_at", "user_id", "survey_id", "evaluated_user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["answered", false], ["created_at", "2018-05-17 17:24:14.069646"], ["updated_at", "2018-05-17 17:24:14.069646"], ["user_id", 1], ["survey_id", 13], ["evaluated_user_id", 3]]
INSERT INTO "survey_results" ("assigned_survey_id", "answer_solution_id", "answer_solution_rates", "answer_solution_feedback", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "solutions".* FROM "solutions" WHERE "solutions"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
                        evaluated_user_id: current_user.id,
                        answered: false)
    if @as.save
      @sr = SurveyResult.create(
                                assigned_survey_id: @as.id,
                                answer_solution_id: params[:answer_solution_id],
                                answer_solution_rates: params[:answer_solution_rates],
                                answer_solution_feedback: params[:answer_solution_feedback])
      if @sr.save
        solution = Solution.find_by(id: @sr.answer_solution_id)
        solution.feedbacks.create(:user_id => current_user.id,
                                  :survey_id => solution.survey_id,
                                  :question_id => solution.question_id,
                                  :content => @sr.answer_solution_feedback)

UPDATE "solutions" SET "solution_rates" = $1 WHERE "solutions"."id" = $2  [["solution_rates", "\"shareability\"=>\"1\", \"relevance\"=>\"1\", \"uniqueness\"=>\"1\", \"usefulness\"=>\"1\", \"purchase_intent\"=>\"1\""], ["id", 13]]
---
          puts "----------------RATES NOW ----------------"
          p solution_rates
          p solution.solution_rates
          solution.save

UPDATE "solutions" SET "solution_rates" = $1 WHERE "solutions"."id" = $2  [["solution_rates", "\"relevance\"=>\"1.0\", \"uniqueness\"=>\"1.0\", \"usefulness\"=>\"1.0\", \"shareability\"=>\"1.0\", \"purchase_intent\"=>\"1.0\""], ["id", 13]]
---
          p average
          puts "---------------------------------------"
          solution.solution_rates = average
          solution.save

UPDATE "assigned_surveys" SET "answered" = $1, "updated_at" = $2 WHERE "assigned_surveys"."id" = $3  [["answered", true], ["updated_at", "2018-05-17 17:25:03.682628"], ["id", 2]]
UPDATE "surveys" SET "respondents_count" = $1, "updated_at" = $2 WHERE "surveys"."id" = $3  [["respondents_count", 1], ["updated_at", "2018-05-17 17:24:14.173859"], ["id", 13]]
UPDATE "surveys" SET "updated_at" = $1, "survey_identifier" = $2 WHERE "surveys"."id" = $3  [["updated_at", "2018-05-17 17:24:14.179265"], ["survey_identifier", "6189bb8494d415370781"], ["id", 13]]
---
        end
        solution.save
        survey.respondents_count = survey.assigned_surveys.with_answer(true).count
        survey.save

        if !survey.survey_identifier
          survey.survey_identifier = SecureRandom.hex(10)
          survey.save

INSERT INTO "questions" ("survey_id", "created_at", "updated_at", "content") VALUES ($1, $2, $3, $4) RETURNING "id"  [["survey_id", 19], ["created_at", "2018-05-17 17:17:34.185979"], ["updated_at", "2018-05-17 17:17:34.185979"], ["content", "Would you like a piece of cake?"]]
INSERT INTO "solutions" ("question_id", "content") VALUES ($1, $2) RETURNING "id"  [["question_id", 19], ["content", "first options content"]]
INSERT INTO "surveys" ("title", "user_type", "user_id", "created_at", "updated_at", "status", "survey_type", "total_price", "cost_per_user", "max_participants_count", "target_audience") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @survey = current_user.surveys.new(survey_params)

    @questions = @survey.questions
    @solutions = @survey.solutions

    @questions.each do |question|
      new_question = Question.new(question['question_id'])
      new_question.save
    end

    @questions[0].solutions << @solutions
    @survey.user = current_user
    if @survey.save

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" != $1  [["user_id", 3]]
---
  def send_notifications_to_users(survey)
    @query = survey.target_audience.delete_if { |k,v| v.downcase == "include all"}
    @founded_profiles = Profile.where.not(user_id: current_user).where(@query)

SELECT "solutions"."id" FROM "solutions" WHERE "solutions"."survey_id" = $1  [["survey_id", 18]]
---
  def show
    surv = @survey
    results_count = AssignedSurvey.with_answer(true).where(survey_id: surv.id).count
    assigned_ids = AssignedSurvey.with_answer(true).where(survey_id: surv.id)
    total_results = SurveyResult.where(assigned_survey_id: assigned_ids)
    # p AssignedSurvey.with_answer(true).any? {|v| v.survey_id == surv.id}
    solutions_ids = surv.solutions.pluck(:id)

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."solution_id" = $1  [["solution_id", 20]]
SELECT "solutions".* FROM "solutions" WHERE "solutions"."survey_id" = $1  [["survey_id", 18]]
---
    p data.as_json

    render json: {
      survey: @survey.as_json( :only => [:id, :title, :user_id, :target_audience]),
      percentage: data,
      respondents_count: total_results.count,
      solutions: @survey.solutions.as_json(:include => { :feedbacks => {:only => [:id, :question_id, :user_id, :solution_id, :content] } },
                                           :only => [:id, :question_id, :content, :image, :video, :solution_rates])

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
  def set_survey
    @survey = Survey.find(params[:id])